onvif/devicemgmt/xml/DeviceBinding.AddIPAddressFilter.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
  xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:chan="http://schemas.microsoft.com/ws/2005/02/duplex"
  xmlns:wsa5="http://www.w3.org/2005/08/addressing"
  xmlns:xmime="http://tempuri.org/xmime.xsd"
  xmlns:xop="http://www.w3.org/2004/08/xop/include"
  xmlns:tt="http://www.onvif.org/ver10/schema"
  xmlns:wsrfbf="http://docs.oasis-open.org/wsrf/bf-2"
  xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2"
  xmlns:wstop="http://docs.oasis-open.org/wsn/t-1"
  xmlns:tds="http://www.onvif.org/ver10/device/wsdl">
 <SOAP-ENV:Header>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <tds:AddIPAddressFilter>
    <tds:IPAddressFilter>
     <tt:Type>Allow</tt:Type>
     <tt:IPv4Address>
      <tt:Address></tt:Address>
      <tt:PrefixLength>0</tt:PrefixLength>
     </tt:IPv4Address>
     <tt:IPv4Address>
      <tt:Address></tt:Address>
      <tt:PrefixLength>0</tt:PrefixLength>
     </tt:IPv4Address>
     <tt:IPv6Address>
      <tt:Address></tt:Address>
      <tt:PrefixLength>0</tt:PrefixLength>
     </tt:IPv6Address>
     <tt:IPv6Address>
      <tt:Address></tt:Address>
      <tt:PrefixLength>0</tt:PrefixLength>
     </tt:IPv6Address>
     <tt:Extension>
      <!-- extensibility element(s) -->

      <!-- extensibility element(s) -->

     </tt:Extension>
    </tds:IPAddressFilter>
   </tds:AddIPAddressFilter>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
